Autodesk.Revit.DB.Fabrication.FabricationPartRouteEnd.CreateFromCenterline(Autodesk.Revit.DB.Element,Autodesk.Revit.DB.XYZ)
Create fabrication routing end from centerline point on straight element.
element:
The straight element that the centerline is on.
ptAt:
A point along the straight element where the fitting to be cut in should be positioned.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.Fabrication.FabricationPartRouteEnd.CreateFromConnector(Autodesk.Revit.DB.Connector)
Create fabrication routing end from connector end point.
connnector:
The connector that the route will connect to. The connector cannot have an existing connection.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Connector is connected.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017